//HW_9

//1 Вивести на сторінку в один рядок через кому числа від 10 до 20.
// let i = 10;
// while (i <= 20) {
//     i === 20
//         ? document.write(i + '.')
//         : document.write(i + ',');
//     i++;
// }

//2 Вивести квадрати чисел від 10 до 20.
// let i = 10;
// while (i <= 20) {
//     i === 20
//         ? document.write(i * i + '.')
//         : document.write(i * i + ',');
//     i++;
// }

//3 Вивести таблицю множення на 7.
// for (let i = 1; i<=10; i++) {
//     document.write(`${i}*7=${i*7}` + '<br>');
// }

//4 Знайти суму всіх цілих чисел від 1 до 15.
// let sum = 0;
// for (let i = 1; i <= 15; i++) {
//     sum += i;
// }
// document.write('Сума чисел від 1 до 15: ' + sum);

//5 Знайти добуток усіх цілих чисел від 15 до 35.
// let mult = 1;
// for (let i = 15; i <= 35; i++) {
//     mult *= i;
// }
// document.write('Добуток чисел від 15 до 35: ' + mult);

//6 Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let sum = 0;
// for (let i = 1; i <= 500; i++) {
//     sum += i;
// }
// let average = sum / 500;
// document.write('Середнє арифметичне чисел від 1 до 500: ' + ~~(average));

//7 Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let sum = 0;
// for (let i = 30; i <= 80; i++) {
//     if (i % 2 === 0) {
//         sum += i;
//     }
// }
// document.write('Cуму парних чисел в діапазоні від 30 до 80: ' + sum);

//8 Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// let sum = 0;
// for (let i = 100; i <= 200; i++) {
//     if (i % 3 === 0) {
//         document.write(i + '<br>');
//     }
// }

//9 Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// const num = 38;
// document.write('Дільники числа ' + num + ': ');
// for (let i = 1; i <= num; i++) {
//     if (num % i === 0) {
//         document.write(i + ' ');
//     }
// }

//10 Визначити кількість його парних дільників.
// let num = 38;
// let count = 0;
//
// for (let i = 1; i <= num; i++) {
//     if (num % i === 0 && i % 2 === 0) {
//         count++;
//     }
// }
//
// document.write(`Кількість парних дільників числа ${num} дорівнює ${count}.`);


//11 Знайти суму його парних дільників.
// let num = 38;
// let sum = 0;
//
// for (let i = 1; i <= num; i++) {
//     if (num % i === 0 && i % 2 === 0) {
//         sum += i;
//     }
// }
//
// document.write(`Сума парних дільників числа ${num} дорівнює ${sum}.`);

//12 Надрукувати повну таблицю множення від 1 до 10.
// for (let i = 1; i <= 10; i++) {
//     for (let j = 1; j <= 10; j++) {
//         document.write(`${i} x ${j} = ${i*j}` + '<br>');
//     }
//     document.write('<br>');
// }

//HW_10

//1 Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// for (let i = 20; i <= 30; i += 0.5) {
//     (i === 30) ? document.write(i + '.') : document.write(i + ', ');
// }

//2 Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
// for (let i = 10; i <= 100; i += 10) {
//     document.write(`${i} доларів коштує: ${i * 27}грн <br>`);
// }

//3 Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// let n = 35;
//     document.write(`Всі цілі числа від 1 до 100, квадрат яких не перевищує числа ${n}:<br>`);
//
// for (let i = 1; i <= 100; i++) {
//     if (i * i < n)
//         document.write(`${i}<br>`);
// }


//4 Дане ціле число. З'ясувати, чи є воно простим (простим називається число,
// більше 1, які не мають інших дільників крім 1 і себе).

// let n = 1;
// let isPrime;
//
// if (n <= 1) {
//     isPrime = `Число ${n} не є простим!`;
// }
//
// for (let i = 2; i < n; i++) {
//     if (n % i === 0) {
//         isPrime = `Число ${n} не є простим!`;
//         break;
//     } else {
//         isPrime = `Число ${n} є простим!`;
//     }
// }
//
// document.write(isPrime);


//5 Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь.
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let n = 81;
let result;

for (let i = 0; i < n; i++) {
    if (n === 3 ** i) {
        result = `Це число ${n} можна одержати шляхом зведення числа 3 у ${i} ступінь`;
        break;
    } else {
        result = `Це число ${n} не можна одержати шляхом зведення числа 3 у деякий  ступінь`;
    }
}

document.write(result);